talpachen/vsf_2017/vsf/hal/cpu/gd32e10x/gd32e10x_include.h
#ifndef __GD32E10X_INCLUDE_H__
#define __GD32E10X_INCLUDE_H__

#ifdef cplusplus
 extern "C" {
#endif 

#include "include/gd32e10x_adc.h"
#include "include/gd32e10x_bkp.h"
#include "include/gd32e10x_can.h"
#include "include/gd32e10x_crc.h"
#include "include/gd32e10x_ctc.h"
#include "include/gd32e10x_dac.h"
#include "include/gd32e10x_dbg.h"
#include "include/gd32e10x_dma.h"
#include "include/gd32e10x_exmc.h"
#include "include/gd32e10x_exti.h"
#include "include/gd32e10x_fmc.h"
#include "include/gd32e10x_fwdgt.h"
#include "include/gd32e10x_gpio.h"
#include "include/gd32e10x_i2c.h"
#include "include/gd32e10x_misc.h"
#include "include/gd32e10x_pmu.h"
#include "include/gd32e10x_rcu.h"
#include "include/gd32e10x_rtc.h"
#include "include/gd32e10x_spi.h"
#include "include/gd32e10x_timer.h"
#include "include/gd32e10x_usart.h"
#include "include/gd32e10x_wwdgt.h"
#include "include/gd32e10x_usb_regs.h"

#ifdef cplusplus
}
#endif

#endif	// __GD32E10X_INCLUDE_H__
